% 灰色预测类型：
% 某地区年平均降雨量数据如表 5
% 表 5 某地区年平均降雨量数据
% 年 1 2 3 4 5 6 7 8 9
% 降雨量 390.6 412 320 559.2 380.8 542.4 553 310 561
% 年 10 11 12 13 14 15 16 17
% 降雨量 300 632 540 406.2 313.8 576 587.6 318.5
% 规定ζ = 320 ，并认为 x (i) ≤ ζ 为旱灾。预测下一次旱灾发生的时间。

clc,clear
% 原始数据
a=[390.6,412,320,559.2,380.8,542.4,553,310,561,300,632,540,406.2,313.8,576,587.6,318.5]';

t0=find(a<=320);
t1=cumsum(t0);
n=length(t1);
B=[-0.5*(t1(1:end-1)+t1(2:end)),ones(n-1,1)];
Y=t0(2:end);
r=B\Y;
y=dsolve('Dy+a*y=b','y(0)=y0');
y=subs(y,{'a','b','y0'},{r(1),r(2),t1(1)});
yuce1=subs(y,'t',[0:n+1]);

digits(6),y=vpa(y); %为提高预测精度，先计算预测值，再显示微分方程的解

yuce=diff(yuce1);
yuce=[t0(1),yuce]


