% 通过对某健将级女子铅球运动员的跟踪调查， 获得其 1982 年至 1986 年每年
% 最好成绩及 16 项专项素质和身体素质的时间序列资料，见表 2，试对此铅球运动员的
% 专项成绩进行因素分析。
% 表 2 各项成绩数据
% 1982 1983 1984 1985 1986
% 铅球专项成绩
% x0
% 13.6 14.01 14.54 15.64 15.69
% 4kg 前抛 x1 11.50 13.00 15.15 15.30 15.02
% 4kg 后抛 x2 13.76 16.36 16.90 16.56 17.30
% 4kg 原地 x3 12.41 12.70 13.96 14.04 13.46
% 立定跳远
% x4
% 2.48 2.49 2.56 2.64 2.59
% 高 翻
% x5
% 85 85 90 100 105
% 抓 举
% x6
% 55 65 75 80 80
% 卧 推
% x7
% 65 70 75 85 90
% 3kg 前抛 x8 12.80 15.30 16.24 16.40 17.05
% 3kg 后抛 x9 15.30 18.40 18.75 17.95 19.30
% 3kg 原地 x10 12.71 14.50 14.66 15.88 15.70
% 3kg 滑步 x11 14.78 15.54 16.03 16.87 17.82
% 立定三级跳远
% x12
% 7.64 7.56 7.76 7.54 7.70
% 全 蹲
% x13
% 120 125 130 140 140
% 挺 举
% x14
% 80 85 90 90 95
% 30 米起跑
% x15
% 4’’2 4’’25 4’’1 4’’06 3’’99
% 100 米
% x16
% 13’’1 13’’42 12’’85 12’’72 12’’56


clc,clear
load x.txt %把原始数据存放在纯文本文件 x.txt 中
for i=1:15
    x(i,:)=x(i,:)/x(i,1); %标准化数据
end

for i=16:17
    x(i,:)=x(i,1)./x(i,:); %标准化数据
end

data=x;
n=size(data,1);
ck=data(1,:);m1=size(ck,1);
bj=data(2:n,:);m2=size(bj,1);

for i=1:m1
    for j=1:m2
        t(j,:)=bj(j,:)-ck(i,:);
    end
    
    jc1=min(min(abs(t')));
    jc2=max(max(abs(t')));
    
    rho=0.5;
    ksi=(jc1+rho*jc2)./(abs(t)+rho*jc2);
    rt=sum(ksi')/size(ksi,2);
    r(i,:)=rt;
end

r
[rs,rind]=sort(r,'descend'); %对关联度进行排序