%求拉格朗日插值多项式和基函数  
%输入的量:n+1个节点(x_i,y_i)(i = 1,2, ... , n+1)横坐标向量X，纵坐标向量Y  
%输出的量：n次拉格朗日插值多项式L及其系数向量C，基函数l及其系数矩阵L
function [C,L] = Lagrange(X,Y)  
m = length(X); 
L = ones(m);  
for k = 1 : m  
    V = 1;  
    for i = 1 : m  
        if k ~= i  
            V = conv(V,poly(X(i))) / (X(k) - X(i));  
        end  
    end  
    L1(k, :) = V; 
    l(k, :) = poly2sym(V);  
end  
C = Y * L1;  
L = Y * l;  


% conv（）函数是用于计算向量的卷积和多项式乘法。
% 使用说明：
% w=conv（u，v）
% u，v为向量，其长度可以不相同。
% 实例1：多项式乘法，（s^2+2s+2）（s+4）（s+1）
% w=conv（[1,2,2]，conv（[1,4]，[1,1]））
% w =
%      1     7    16    18     8
% P=poly2str(w,'s')
% P =
%    s^4 + 7 s^3 + 16 s^2 + 18 s + 8
% 实例2：向量的卷积，长度为m的向量序列u和长度为n的向量序列v的卷积，
% w（k）=Σu(j)v(k+1-j)
% 式中，w向量序列的长度为（m+n-1）,当m=n时，有
% w(1) = u(1)*v(1)
% w(2) = u(1)*v(2)+u(2)*v(1)
% w(3) = u(1)*v(3)+u(2)*v(2)+u(3)*v(1)
% ...
% w(n) = u(1)*v(n)+u(2)*v(n-1)+ ... +u(n)*v(1)
% ...
% w(2*n-1) = u(n)*v(n)