function main
clear,clc

X=[0.4 	0.55 	0.65 	0.80 	0.95 	1.05 ];
Y=[0.41075 	0.57815	0.69675	0.90 	1.00 	1.25382 ];

[C,L] = Lagrange(X,Y);

%输出拉格朗日插住多项式系数
C

%输出拉格朗日插住多项式
L

%定义符号变量x
syms x;

% 使用变量精度算法(VPA)去计算A中每个元素为d小数位精度，其中d是当前设置的位数，结果的每个元素是符号表达式。 
% R = vpa(A, d) 用d个位数代替当前设置的位数。 比如：vpa pi 75来计算pi的75位精度。 
% 系数按精度输出拉格朗日插住多项式
Result=vpa(L,6)

%数值计算
f1=vpa(subs(Result,x,0.596),6)

f2=vpa(subs(Result,x,0.99),6)


%插值函数图像绘制
fplot(@(x)121.626*x^5 - 422.75*x^4 + 572.567*x^3 - 377.255*x^2 + 121.972*x - 15.0845,[-10,10]);

end
