%等量同号点电荷的场
p1=10; p2=10;                  %点电荷所带电量 
axis([-5,5,-5,5]);                %设定坐标轴范围 -5≤x≤5,-5≤y≤5 
hold  on                       %图形控制,不可擦除模式 
plot(2,0,'*r'); plot(-2,0,'*r')         %绘制两源电荷 
a=(pi/24):pi/12:(2*pi-pi/24);       %圆周上电场线起点所对应的角度 
b=0.1*cos(a);c=0.1*sin(a);       %电场线起点所对应的相对坐标
b1=-2+b;b2=2+b;               %把起点圆周的圆心放置在源电荷处 
b0=[b1 b2]; c0=[c c];            %初始条件，所有电场线的起点 
                                 %的横、纵坐标构成了矢量b0 和c0
for i=1:48                       %循环求解48 次微分方程 
b0(i)
    [t,y]=ode45('dcx1fun',[0:0.05:40],[b0(i),c0(i)],[ ],p1,p2); %调用ode45求解，
                                 %对应一个初条件（起点） ，求解出一条电场线 
plot(y(:,1),y(:,2),'b')          %绘制出此条电场线 
end                       
