%能源类型统计
clear,clc

% data=[122499532.7 292544.7424 88600645.57 31045.47382 38994792.74...
% 2491059.934 121953440.9 3422578.982 8504878.698 20443107.3 4039.36891...
% 7150296.19];

%能源种类
% 德克萨斯州(TX)
data=[122499532.7,48906685.31,51665342.73,292544.7424,88600645.57,31045.47382,38994792.74,2491059.934,121953440.9,3422578.982,639605692.3,8504878.698,20443107.3,4039.36891,7150296.19];%输入数据
label={'P1T','CLT','DFT','EMT','EST','GET','JFT','KST','LGT','LUT','NGT','PCT','RFT','SFT','WWT'};%输入标签

%
% 加利福尼亚(CA)
% data=[6103336.85,44894917.63,633165.932,78996665,3902176.577,49693839.31,549345.0106,7420717.721,3220886.346,343117659.2,3808619.103,42082379.55,0,12926831.03];
% label={'CLT','DFT','EMT','EST','GET','JFT','KST','LGT','LUT','NGT','PCT','RFT','SFT','WWT'};
% 
% 新墨西哥州(NM)
% data=[10482138.53,5737192.868,33778.9699,5239964.942,16424.73392,1706445.157,250344.9472,2057024.38,218038.6777,41376972.61,125846.7961,382876.7393,4.1627,585481.2225];
% label={'CLT','DFT','EMT','EST','GET','JFT','KST','LGT','LUT','NGT','PCT','RFT','SFT','WWT'};

% 亚利桑那州(AZ)
% data=[13281641.07,8440992.572,102070.4278,16016433.45,11151.99672,4983907.405,45538.36084,690510.5769,363940.3938,24940265.04,0,429125.6107,206.5497,1087921.716];
% label={'CLT','DFT','EMT','EST','GET','JFT','KST','LGT','LUT','NGT','PCT','RFT','SFT','WWT'};



%可再生能源分类
% 德克萨斯州(TX)
% data=[4.114048920000000e+03 1.106835255000000e+04 2.725026437220000e+06 4.109356336000000e+05];
% label={'geothermal energy','hydroenergy','Solar energy','wind energy'};

% 加利福尼亚(CA)
% data=[2.677750240600000e+05 3.000788181600000e+05 3.161583791990000e+06 1.198329676800000e+05];
% label={'geothermal energy','hydroenergy','Solar energy','wind energy'};


% % 新墨西哥州(NM)
% data=[6.341340400000000e+02 2.915561880000000e+03 2.026677117100000e+05 2.026677117100000e+05];
% label={'geothermal energy','hydroenergy','Solar energy','wind energy'};
% 
% % 亚利桑那州(AZ)
% data=[6.581972400000000e+02 6.581972400000000e+02 4.983694671300000e+05 6.062634000000000e+02];
% label={'geothermal energy','hydroenergy','Solar energy','wind energy'};

% explode=[0 1 0 0];%定义突出的部分
bili=data/sum(data);%计算比例
baifenbi=num2str(bili'*100,'%1.2f');%计算百分比
baifenbi=[repmat(blanks(2),length(data),1),baifenbi,repmat('%',length(data),1)];
baifenbi=cellstr(baifenbi);
Label=strcat(label,baifenbi');
pie3(data,Label)
title('Renewable energy type - Arizona ');