%=====================最小二乘拟合====================

clear,clc

% 数据点记录

% 大神的数据
% 数据一
% x=[26 29 32 35 38 41 44 47 50 53 56 59 62 65 68 71 74 77];
% y=[0.2 0.3 0.4 0.5 0.6 0.8 0.9 1.0 1.1 1.2 1.3 1.5 1.6 1.7 1.8 1.9 2.1 2.2];

% 数据二
x=[30 33 36 39 42 45 48 51 54 57 60 63 66 69 72 75 78 81 84 87];
y=[0.3017 0.3038 0.3065 0.3095 0.3126 0.3145 0.3175 0.3205 0.3234 0.3260 0.3284 0.3313 0.3347 0.3378 0.3401 0.3434 0.3456 0.3492 0.3519 0.3549];


% 小呆头的数据
% 数据一
% x=[18.2 22 26 30 34 38 42 46 50 54 58 62 66 70 74 78 82 86 90 94];
% y=[0 0.1 0.2 0.4 0.5 0.7 0.8 1.0 1.2 1.3 1.5 1.6 1.8 2.0 2.2 2.3 2.5 2.7 2.8 3.0];

% 数据二
% x=[33 36 39 42 45 48 51 54 57 60 63 66 69 72 75 78 81 84 87];
% y=[0.2975 0.3012 0.3038 0.3064 0.3090 0.3117 0.3144 0.3172 0.3199 0.3227 0.3255 0.3284 0.3312 0.3340 0.3369 0.3395 0.3418 0.3442 0.3467];




% 原始数据绘制
plot(x,y,'-*')
grid on


disp( 'x平均值');
x_avg=sum(x)/length(x)

disp( 'y平均值');
y_avg=sum(y)/length(y)

disp( 'x^2 平均值');
x_d_avg=sum(x.^2)/length(x)

disp('y^2 平均值');
y_d_avg=sum(y.^2)/length(y)

disp(' xy 平均值');
xy_avg=sum(x.*y)/length(x)


disp(' 系数求解');
a=(x_avg*y_avg-xy_avg)/(x_avg*x_avg-x_d_avg)

b=y_avg-a*x_avg

fun=@(X)a*X+b;

% 拟合图像绘制
ezplot(fun,x(1),x(length(x)));
grid on

disp('相关系数求解');
r=(xy_avg-x_avg*y_avg)/sqrt((x_d_avg-x_avg*x_avg)*(y_d_avg-y_avg*y_avg))
