%%%%%%%%%%%%%%%%以下诶要显示的数据%%%%%%%%%%%%%%%%%%%
head = '序号	 班名	 学号	 姓名  平时成绩	期末成绩';
text = {'51121', '5112101', '陈';
           '51121', '5112103', '李';
           '51121', '5112105', '刘'};
num = [ 0	 63;	
             0	 73;		
             0	 88 ];
%%%%%%%%%%%%以下为将数据存入data.txt的程序代码%%%%%%%%%
fid = fopen('data.txt', 'wt');     %以只写、文本模式打开文件data.txt
fprintf(fid, [head '\n']);           %写入第一行的文本数据
for i = 1 : 3                           %按指定格式依次写入每一行数据
    fprintf(fid, '%d	%s	%s	 %s	 %d	 %d\n', i, text{i, 1}, ...
        text{i, 2}, text{i, 3}, num(i, 1), num(i, 2));
end
fclose(fid);                           %关闭文件data.txt
