%问题二求解：获取180次照射中最宽和最窄的数据

%载入附件三数据
load Receive3


% 对信息接收矩阵中每一列中非零的数据计数
Count=sum(Receive3>0);  

%中心实际坐标:(60.8382,73.3392)-->像素坐标:(155.7453,187.7484)-->相对画板长度的像素坐标：(101.6862,133.6893)
%系统与画板边界的距离差值 (实际值)w=21.1168 Pw=54.0591
%V_max：最宽时穿过背测介质的光线条数 I_max：记录像最宽旋转编号 
%计算数据：I_max=52 V_max=296 
%统计得到没有光线的探测单元个数(相对系统长度)：up 100->27.7800->71.1168   mid=82.2288->210.5057       down 116->32.2248->82.4955
%统计得到没有光线的探测单元个数(相对画板长度)：up 100->27.7800-21.1168   mid=82.2288->210.5057       down 116->32.2248-21.1168->
%系统实际距离计算：27.7800 + 82.2288 + 32.2248=142.2336
%系统像素个数计算: 71.1168+210.5057 +82.4955=364.1180
[V_max, I_max] = max(Count);
 
%V_min：最窄时穿过背测介质的光线条数 I_min：记录像最窄旋转编号 
%计算数据：I_min=146 V_min=156 
%统计得到没有光线的探测单元个数(相对系统长度)：up 141->39.1698->100.2747   mid=43.3368->110.9422    down 215->59.7270->152.9011
%统计得到没有光线的探测单元个数(相对画板长度)：up 141->39.1698->100.2747   mid=43.3368->110.9422    down 215->59.7270->152.9011
%系统实际计算：39.1698+43.3368+59.7270=142.2336
%系统像素个数计算: 100.2747 +110.9422 +152.9011=364.1180
[V_min, I_min] = min(Count);

%探测器单元间的距离
d0=0.2778;

%计算最宽时的长度 82.2288
Length=V_max*d0;

%计算最窄时的长度 43.3368
Width=V_min*d0;

%每个像素点对信息接收的贡献值
k0=0.9995;


%最宽的旋转时刻每条光线经过的像素个数
Pixel_max_lenght=zeros(V_max,1);

for i=1:512
    if (Receive3(i,I_max)~=0)
        Pixel_max_lenght(i,1)=Receive3(i,I_max)*k0;
    end
end

%最窄的旋转时刻每条光线经过的像素个数
Pixel_min_lenght=zeros(V_min,1);
for i=1:512
    if (Receive3(i,I_min)~=0)
        Pixel_min_lenght(i,1)=Receive3(i,I_min)*k0;
    end
end




%绘制问题二中的几何图形

%椭圆图像绘制==参数方程
t = linspace(0,2*pi,90);
x = 21.6684*cos(t);
y = 41.1144*sin(t);

plot(x,y)
title('几何形状解析式：x^2/1690.4+y^2/469.5196=1')
hold on
fill(x,y,'b');
axis image




%问题二吸收率矩阵求解

clear,clc
load Receive2
Absorb2=iradon(Receive2,[0:179]);











