%已知旋转中心代入方程组求解旋转角
clear,clc

%第1次旋转对应方程组:
Result=solve('4.444748e+001=(45+9.30634)*sqrt(1-t1^2)+(0+5.55604)*t1',	 'y1=(-9.30634-45)*t1+(0+5.55604)*sqrt(1-t1^2)',	 'y1',	't1');
Angle1=asin(Result.t1)*(180/pi);

%第2次旋转对应方程组:
Result=solve('4.361414e+001=(45+9.30634)*sqrt(1-t2^2)+(0+5.55604)*t2',	 'y2=(-9.30634-45)*t2+(0+5.55604)*sqrt(1-t2^2)',	 'y2',	't2');
Angle2=asin(Result.t2)*(180/pi);

%第3次旋转对应方程组:
Result=solve('4.333636e+001=(45+9.30634)*sqrt(1-t3^2)+(0+5.55604)*t3',	 'y3=(-9.30634-45)*t3+(0+5.55604)*sqrt(1-t3^2)',	 'y3',	't3');
Angle3=asin(Result.t3)*(180/pi);

%第4次旋转对应方程组:
Result=solve('4.250302e+001=(45+9.30634)*sqrt(1-t4^2)+(0+5.55604)*t4',	 'y4=(-9.30634-45)*t4+(0+5.55604)*sqrt(1-t4^2)',	 'y4',	't4');
Angle4=asin(Result.t4)*(180/pi);

%第5次旋转对应方程组:
Result=solve('4.194746e+001=(45+9.30634)*sqrt(1-t5^2)+(0+5.55604)*t5',	 'y5=(-9.30634-45)*t5+(0+5.55604)*sqrt(1-t5^2)',	 'y5',	't5');
Angle5=asin(Result.t5)*(180/pi);

%第6次旋转对应方程组:
Result=solve('4.139190e+001=(45+9.30634)*sqrt(1-t6^2)+(0+5.55604)*t6',	 'y6=(-9.30634-45)*t6+(0+5.55604)*sqrt(1-t6^2)',	 'y6',	't6');
Angle6=asin(Result.t6)*(180/pi);

%第7次旋转对应方程组:
Result=solve('4.083634e+001=(45+9.30634)*sqrt(1-t7^2)+(0+5.55604)*t7',	 'y7=(-9.30634-45)*t7+(0+5.55604)*sqrt(1-t7^2)',	 'y7',	't7');
Angle7=asin(Result.t7)*(180/pi);

%第8次旋转对应方程组:
Result=solve('4.000300e+001=(45+9.30634)*sqrt(1-t8^2)+(0+5.55604)*t8',	 'y8=(-9.30634-45)*t8+(0+5.55604)*sqrt(1-t8^2)',	 'y8',	't8');
Angle8=asin(Result.t8)*(180/pi);

%第9次旋转对应方程组:
Result=solve('3.944744e+001=(45+9.30634)*sqrt(1-t9^2)+(0+5.55604)*t9',	 'y9=(-9.30634-45)*t9+(0+5.55604)*sqrt(1-t9^2)',	 'y9',	't9');
Angle9=asin(Result.t9)*(180/pi);

%第10次旋转对应方程组:
Result=solve('3.861410e+001=(45+9.30634)*sqrt(1-t10^2)+(0+5.55604)*t10',	 'y10=(-9.30634-45)*t10+(0+5.55604)*sqrt(1-t10^2)',	 'y10',	't10');
Angle10=asin(Result.t10)*(180/pi);

%第11次旋转对应方程组:
Result=solve('3.805854e+001=(45+9.30634)*sqrt(1-t11^2)+(0+5.55604)*t11',	 'y11=(-9.30634-45)*t11+(0+5.55604)*sqrt(1-t11^2)',	 'y11',	't11');
Angle11=asin(Result.t11)*(180/pi);

%第12次旋转对应方程组:
Result=solve('3.750298e+001=(45+9.30634)*sqrt(1-t12^2)+(0+5.55604)*t12',	 'y12=(-9.30634-45)*t12+(0+5.55604)*sqrt(1-t12^2)',	 'y12',	't12');
Angle12=asin(Result.t12)*(180/pi);

%第13次旋转对应方程组:
Result=solve('3.666964e+001=(45+9.30634)*sqrt(1-t13^2)+(0+5.55604)*t13',	 'y13=(-9.30634-45)*t13+(0+5.55604)*sqrt(1-t13^2)',	 'y13',	't13');
Angle13=asin(Result.t13)*(180/pi);

%第14次旋转对应方程组:
Result=solve('3.583630e+001=(45+9.30634)*sqrt(1-t14^2)+(0+5.55604)*t14',	 'y14=(-9.30634-45)*t14+(0+5.55604)*sqrt(1-t14^2)',	 'y14',	't14');
Angle14=asin(Result.t14)*(180/pi);

%第15次旋转对应方程组:
Result=solve('3.528074e+001=(45+9.30634)*sqrt(1-t15^2)+(0+5.55604)*t15',	 'y15=(-9.30634-45)*t15+(0+5.55604)*sqrt(1-t15^2)',	 'y15',	't15');
Angle15=asin(Result.t15)*(180/pi);

%第16次旋转对应方程组:
Result=solve('3.444740e+001=(45+9.30634)*sqrt(1-t16^2)+(0+5.55604)*t16',	 'y16=(-9.30634-45)*t16+(0+5.55604)*sqrt(1-t16^2)',	 'y16',	't16');
Angle16=asin(Result.t16)*(180/pi);

%第17次旋转对应方程组:
Result=solve('3.361406e+001=(45+9.30634)*sqrt(1-t17^2)+(0+5.55604)*t17',	 'y17=(-9.30634-45)*t17+(0+5.55604)*sqrt(1-t17^2)',	 'y17',	't17');
Angle17=asin(Result.t17)*(180/pi);

%第18次旋转对应方程组:
Result=solve('3.305850e+001=(45+9.30634)*sqrt(1-t18^2)+(0+5.55604)*t18',	 'y18=(-9.30634-45)*t18+(0+5.55604)*sqrt(1-t18^2)',	 'y18',	't18');
Angle18=asin(Result.t18)*(180/pi);

%第19次旋转对应方程组:
Result=solve('3.250294e+001=(45+9.30634)*sqrt(1-t19^2)+(0+5.55604)*t19',	 'y19=(-9.30634-45)*t19+(0+5.55604)*sqrt(1-t19^2)',	 'y19',	't19');
Angle19=asin(Result.t19)*(180/pi);

%第20次旋转对应方程组:
Result=solve('3.194738e+001=(45+9.30634)*sqrt(1-t20^2)+(0+5.55604)*t20',	 'y20=(-9.30634-45)*t20+(0+5.55604)*sqrt(1-t20^2)',	 'y20',	't20');
Angle20=asin(Result.t20)*(180/pi);

%第21次旋转对应方程组:
Result=solve('3.166960e+001=(45+9.30634)*sqrt(1-t21^2)+(0+5.55604)*t21',	 'y21=(-9.30634-45)*t21+(0+5.55604)*sqrt(1-t21^2)',	 'y21',	't21');
Angle21=asin(Result.t21)*(180/pi);

%第22次旋转对应方程组:
Result=solve('3.111404e+001=(45+9.30634)*sqrt(1-t22^2)+(0+5.55604)*t22',	 'y22=(-9.30634-45)*t22+(0+5.55604)*sqrt(1-t22^2)',	 'y22',	't22');
Angle22=asin(Result.t22)*(180/pi);

%第23次旋转对应方程组:
Result=solve('3.055848e+001=(45+9.30634)*sqrt(1-t23^2)+(0+5.55604)*t23',	 'y23=(-9.30634-45)*t23+(0+5.55604)*sqrt(1-t23^2)',	 'y23',	't23');
Angle23=asin(Result.t23)*(180/pi);

%第24次旋转对应方程组:
Result=solve('3.000292e+001=(45+9.30634)*sqrt(1-t24^2)+(0+5.55604)*t24',	 'y24=(-9.30634-45)*t24+(0+5.55604)*sqrt(1-t24^2)',	 'y24',	't24');
Angle24=asin(Result.t24)*(180/pi);

%第25次旋转对应方程组:
Result=solve('2.972514e+001=(45+9.30634)*sqrt(1-t25^2)+(0+5.55604)*t25',	 'y25=(-9.30634-45)*t25+(0+5.55604)*sqrt(1-t25^2)',	 'y25',	't25');
Angle25=asin(Result.t25)*(180/pi);

%第26次旋转对应方程组:
Result=solve('2.916958e+001=(45+9.30634)*sqrt(1-t26^2)+(0+5.55604)*t26',	 'y26=(-9.30634-45)*t26+(0+5.55604)*sqrt(1-t26^2)',	 'y26',	't26');
Angle26=asin(Result.t26)*(180/pi);

%第27次旋转对应方程组:
Result=solve('2.861402e+001=(45+9.30634)*sqrt(1-t27^2)+(0+5.55604)*t27',	 'y27=(-9.30634-45)*t27+(0+5.55604)*sqrt(1-t27^2)',	 'y27',	't27');
Angle27=asin(Result.t27)*(180/pi);

%第28次旋转对应方程组:
Result=solve('2.805846e+001=(45+9.30634)*sqrt(1-t28^2)+(0+5.55604)*t28',	 'y28=(-9.30634-45)*t28+(0+5.55604)*sqrt(1-t28^2)',	 'y28',	't28');
Angle28=asin(Result.t28)*(180/pi);

%第29次旋转对应方程组:
Result=solve('2.750290e+001=(45+9.30634)*sqrt(1-t29^2)+(0+5.55604)*t29',	 'y29=(-9.30634-45)*t29+(0+5.55604)*sqrt(1-t29^2)',	 'y29',	't29');
Angle29=asin(Result.t29)*(180/pi);

%第30次旋转对应方程组:
Result=solve('2.666956e+001=(45+9.30634)*sqrt(1-t30^2)+(0+5.55604)*t30',	 'y30=(-9.30634-45)*t30+(0+5.55604)*sqrt(1-t30^2)',	 'y30',	't30');
Angle30=asin(Result.t30)*(180/pi);

%第31次旋转对应方程组:
Result=solve('2.611400e+001=(45+9.30634)*sqrt(1-t31^2)+(0+5.55604)*t31',	 'y31=(-9.30634-45)*t31+(0+5.55604)*sqrt(1-t31^2)',	 'y31',	't31');
Angle31=asin(Result.t31)*(180/pi);

%第32次旋转对应方程组:
Result=solve('2.528066e+001=(45+9.30634)*sqrt(1-t32^2)+(0+5.55604)*t32',	 'y32=(-9.30634-45)*t32+(0+5.55604)*sqrt(1-t32^2)',	 'y32',	't32');
Angle32=asin(Result.t32)*(180/pi);

%第33次旋转对应方程组:
Result=solve('2.472510e+001=(45+9.30634)*sqrt(1-t33^2)+(0+5.55604)*t33',	 'y33=(-9.30634-45)*t33+(0+5.55604)*sqrt(1-t33^2)',	 'y33',	't33');
Angle33=asin(Result.t33)*(180/pi);

%第34次旋转对应方程组:
Result=solve('2.389176e+001=(45+9.30634)*sqrt(1-t34^2)+(0+5.55604)*t34',	 'y34=(-9.30634-45)*t34+(0+5.55604)*sqrt(1-t34^2)',	 'y34',	't34');
Angle34=asin(Result.t34)*(180/pi);

%第35次旋转对应方程组:
Result=solve('2.278064e+001=(45+9.30634)*sqrt(1-t35^2)+(0+5.55604)*t35',	 'y35=(-9.30634-45)*t35+(0+5.55604)*sqrt(1-t35^2)',	 'y35',	't35');
Angle35=asin(Result.t35)*(180/pi);

%第36次旋转对应方程组:
Result=solve('2.222508e+001=(45+9.30634)*sqrt(1-t36^2)+(0+5.55604)*t36',	 'y36=(-9.30634-45)*t36+(0+5.55604)*sqrt(1-t36^2)',	 'y36',	't36');
Angle36=asin(Result.t36)*(180/pi);

%第37次旋转对应方程组:
Result=solve('2.139174e+001=(45+9.30634)*sqrt(1-t37^2)+(0+5.55604)*t37',	 'y37=(-9.30634-45)*t37+(0+5.55604)*sqrt(1-t37^2)',	 'y37',	't37');
Angle37=asin(Result.t37)*(180/pi);

%第38次旋转对应方程组:
Result=solve('2.055840e+001=(45+9.30634)*sqrt(1-t38^2)+(0+5.55604)*t38',	 'y38=(-9.30634-45)*t38+(0+5.55604)*sqrt(1-t38^2)',	 'y38',	't38');
Angle38=asin(Result.t38)*(180/pi);

%第39次旋转对应方程组:
Result=solve('1.972506e+001=(45+9.30634)*sqrt(1-t39^2)+(0+5.55604)*t39',	 'y39=(-9.30634-45)*t39+(0+5.55604)*sqrt(1-t39^2)',	 'y39',	't39');
Angle39=asin(Result.t39)*(180/pi);

%第40次旋转对应方程组:
Result=solve('1.889172e+001=(45+9.30634)*sqrt(1-t40^2)+(0+5.55604)*t40',	 'y40=(-9.30634-45)*t40+(0+5.55604)*sqrt(1-t40^2)',	 'y40',	't40');
Angle40=asin(Result.t40)*(180/pi);

%第41次旋转对应方程组:
Result=solve('1.805838e+001=(45+9.30634)*sqrt(1-t41^2)+(0+5.55604)*t41',	 'y41=(-9.30634-45)*t41+(0+5.55604)*sqrt(1-t41^2)',	 'y41',	't41');
Angle41=asin(Result.t41)*(180/pi);

%第42次旋转对应方程组:
Result=solve('1.694726e+001=(45+9.30634)*sqrt(1-t42^2)+(0+5.55604)*t42',	 'y42=(-9.30634-45)*t42+(0+5.55604)*sqrt(1-t42^2)',	 'y42',	't42');
Angle42=asin(Result.t42)*(180/pi);

%第43次旋转对应方程组:
Result=solve('1.611392e+001=(45+9.30634)*sqrt(1-t43^2)+(0+5.55604)*t43',	 'y43=(-9.30634-45)*t43+(0+5.55604)*sqrt(1-t43^2)',	 'y43',	't43');
Angle43=asin(Result.t43)*(180/pi);

%第44次旋转对应方程组:
Result=solve('1.500280e+001=(45+9.30634)*sqrt(1-t44^2)+(0+5.55604)*t44',	 'y44=(-9.30634-45)*t44+(0+5.55604)*sqrt(1-t44^2)',	 'y44',	't44');
Angle44=asin(Result.t44)*(180/pi);

%第45次旋转对应方程组:
Result=solve('1.389168e+001=(45+9.30634)*sqrt(1-t45^2)+(0+5.55604)*t45',	 'y45=(-9.30634-45)*t45+(0+5.55604)*sqrt(1-t45^2)',	 'y45',	't45');
Angle45=asin(Result.t45)*(180/pi);

%第46次旋转对应方程组:
Result=solve('1.305834e+001=(45+9.30634)*sqrt(1-t46^2)+(0+5.55604)*t46',	 'y46=(-9.30634-45)*t46+(0+5.55604)*sqrt(1-t46^2)',	 'y46',	't46');
Angle46=asin(Result.t46)*(180/pi);

%第47次旋转对应方程组:
Result=solve('1.222500e+001=(45+9.30634)*sqrt(1-t47^2)+(0+5.55604)*t47',	 'y47=(-9.30634-45)*t47+(0+5.55604)*sqrt(1-t47^2)',	 'y47',	't47');
Angle47=asin(Result.t47)*(180/pi);

%第48次旋转对应方程组:
Result=solve('1.111388e+001=(45+9.30634)*sqrt(1-t48^2)+(0+5.55604)*t48',	 'y48=(-9.30634-45)*t48+(0+5.55604)*sqrt(1-t48^2)',	 'y48',	't48');
Angle48=asin(Result.t48)*(180/pi);

%第49次旋转对应方程组:
Result=solve('9.724980e+000=(45+9.30634)*sqrt(1-t49^2)+(0+5.55604)*t49',	 'y49=(-9.30634-45)*t49+(0+5.55604)*sqrt(1-t49^2)',	 'y49',	't49');
Angle49=asin(Result.t49)*(180/pi);

%第50次旋转对应方程组:
Result=solve('8.058300e+000=(45+9.30634)*sqrt(1-t50^2)+(0+5.55604)*t50',	 'y50=(-9.30634-45)*t50+(0+5.55604)*sqrt(1-t50^2)',	 'y50',	't50');
Angle50=asin(Result.t50)*(180/pi);

%第51次旋转对应方程组:
Result=solve('6.669400e+000=(45+9.30634)*sqrt(1-t51^2)+(0+5.55604)*t51',	 'y51=(-9.30634-45)*t51+(0+5.55604)*sqrt(1-t51^2)',	 'y51',	't51');
Angle51=asin(Result.t51)*(180/pi);

%第52次旋转对应方程组:
Result=solve('5.280500e+000=(45+9.30634)*sqrt(1-t52^2)+(0+5.55604)*t52',	 'y52=(-9.30634-45)*t52+(0+5.55604)*sqrt(1-t52^2)',	 'y52',	't52');
Angle52=asin(Result.t52)*(180/pi);

%第53次旋转对应方程组:
Result=solve('4.169380e+000=(45+9.30634)*sqrt(1-t53^2)+(0+5.55604)*t53',	 'y53=(-9.30634-45)*t53+(0+5.55604)*sqrt(1-t53^2)',	 'y53',	't53');
Angle53=asin(Result.t53)*(180/pi);

%第54次旋转对应方程组:
Result=solve('2.780480e+000=(45+9.30634)*sqrt(1-t54^2)+(0+5.55604)*t54',	 'y54=(-9.30634-45)*t54+(0+5.55604)*sqrt(1-t54^2)',	 'y54',	't54');
Angle54=asin(Result.t54)*(180/pi);

%第55次旋转对应方程组:
Result=solve('1.113800e+000=(45+9.30634)*sqrt(1-t55^2)+(0+5.55604)*t55',	 'y55=(-9.30634-45)*t55+(0+5.55604)*sqrt(1-t55^2)',	 'y55',	't55');
Angle55=asin(Result.t55)*(180/pi);

%第56次旋转对应方程组:
Result=solve('2.751000e-001=(45+9.30634)*sqrt(1-t56^2)+(0+5.55604)*t56',	 'y56=(-9.30634-45)*t56+(0+5.55604)*sqrt(1-t56^2)',	 'y56',	't56');
Angle56=asin(Result.t56)*(180/pi);

%第57次旋转对应方程组:
Result=solve('1.941780e+000=(45+9.30634)*sqrt(1-t57^2)+(0+5.55604)*t57',	 'y57=(-9.30634-45)*t57+(0+5.55604)*sqrt(1-t57^2)',	 'y57',	't57');
Angle57=asin(Result.t57)*(180/pi);

%第58次旋转对应方程组:
Result=solve('3.330680e+000=(45+9.30634)*sqrt(1-t58^2)+(0+5.55604)*t58',	 'y58=(-9.30634-45)*t58+(0+5.55604)*sqrt(1-t58^2)',	 'y58',	't58');
Angle58=asin(Result.t58)*(180/pi);

%第59次旋转对应方程组:
Result=solve('4.719580e+000=(45+9.30634)*sqrt(1-t59^2)+(0+5.55604)*t59',	 'y59=(-9.30634-45)*t59+(0+5.55604)*sqrt(1-t59^2)',	 'y59',	't59');
Angle59=asin(Result.t59)*(180/pi);

%第60次旋转对应方程组:
Result=solve('6.108480e+000=(45+9.30634)*sqrt(1-t60^2)+(0+5.55604)*t60',	 'y60=(-9.30634-45)*t60+(0+5.55604)*sqrt(1-t60^2)',	 'y60',	't60');
Angle60=asin(Result.t60)*(180/pi);

%第61次旋转对应方程组:
Result=solve('7.497380e+000=(45+9.30634)*sqrt(1-t61^2)+(0+5.55604)*t61',	 'y61=(-9.30634-45)*t61+(0+5.55604)*sqrt(1-t61^2)',	 'y61',	't61');
Angle61=asin(Result.t61)*(180/pi);

%第62次旋转对应方程组:
Result=solve('8.886280e+000=(45+9.30634)*sqrt(1-t62^2)+(0+5.55604)*t62',	 'y62=(-9.30634-45)*t62+(0+5.55604)*sqrt(1-t62^2)',	 'y62',	't62');
Angle62=asin(Result.t62)*(180/pi);

%第63次旋转对应方程组:
Result=solve('1.055296e+001=(45+9.30634)*sqrt(1-t63^2)+(0+5.55604)*t63',	 'y63=(-9.30634-45)*t63+(0+5.55604)*sqrt(1-t63^2)',	 'y63',	't63');
Angle63=asin(Result.t63)*(180/pi);

%第64次旋转对应方程组:
Result=solve('1.166408e+001=(45+9.30634)*sqrt(1-t64^2)+(0+5.55604)*t64',	 'y64=(-9.30634-45)*t64+(0+5.55604)*sqrt(1-t64^2)',	 'y64',	't64');
Angle64=asin(Result.t64)*(180/pi);

%第65次旋转对应方程组:
Result=solve('1.277520e+001=(45+9.30634)*sqrt(1-t65^2)+(0+5.55604)*t65',	 'y65=(-9.30634-45)*t65+(0+5.55604)*sqrt(1-t65^2)',	 'y65',	't65');
Angle65=asin(Result.t65)*(180/pi);

%第66次旋转对应方程组:
Result=solve('1.360854e+001=(45+9.30634)*sqrt(1-t66^2)+(0+5.55604)*t66',	 'y66=(-9.30634-45)*t66+(0+5.55604)*sqrt(1-t66^2)',	 'y66',	't66');
Angle66=asin(Result.t66)*(180/pi);

%第67次旋转对应方程组:
Result=solve('1.471966e+001=(45+9.30634)*sqrt(1-t67^2)+(0+5.55604)*t67',	 'y67=(-9.30634-45)*t67+(0+5.55604)*sqrt(1-t67^2)',	 'y67',	't67');
Angle67=asin(Result.t67)*(180/pi);

%第68次旋转对应方程组:
Result=solve('1.555300e+001=(45+9.30634)*sqrt(1-t68^2)+(0+5.55604)*t68',	 'y68=(-9.30634-45)*t68+(0+5.55604)*sqrt(1-t68^2)',	 'y68',	't68');
Angle68=asin(Result.t68)*(180/pi);

%第69次旋转对应方程组:
Result=solve('1.638634e+001=(45+9.30634)*sqrt(1-t69^2)+(0+5.55604)*t69',	 'y69=(-9.30634-45)*t69+(0+5.55604)*sqrt(1-t69^2)',	 'y69',	't69');
Angle69=asin(Result.t69)*(180/pi);

%第70次旋转对应方程组:
Result=solve('1.721968e+001=(45+9.30634)*sqrt(1-t70^2)+(0+5.55604)*t70',	 'y70=(-9.30634-45)*t70+(0+5.55604)*sqrt(1-t70^2)',	 'y70',	't70');
Angle70=asin(Result.t70)*(180/pi);

%第71次旋转对应方程组:
Result=solve('1.805302e+001=(45+9.30634)*sqrt(1-t71^2)+(0+5.55604)*t71',	 'y71=(-9.30634-45)*t71+(0+5.55604)*sqrt(1-t71^2)',	 'y71',	't71');
Angle71=asin(Result.t71)*(180/pi);

%第72次旋转对应方程组:
Result=solve('1.888636e+001=(45+9.30634)*sqrt(1-t72^2)+(0+5.55604)*t72',	 'y72=(-9.30634-45)*t72+(0+5.55604)*sqrt(1-t72^2)',	 'y72',	't72');
Angle72=asin(Result.t72)*(180/pi);

%第73次旋转对应方程组:
Result=solve('1.971970e+001=(45+9.30634)*sqrt(1-t73^2)+(0+5.55604)*t73',	 'y73=(-9.30634-45)*t73+(0+5.55604)*sqrt(1-t73^2)',	 'y73',	't73');
Angle73=asin(Result.t73)*(180/pi);

%第74次旋转对应方程组:
Result=solve('2.055304e+001=(45+9.30634)*sqrt(1-t74^2)+(0+5.55604)*t74',	 'y74=(-9.30634-45)*t74+(0+5.55604)*sqrt(1-t74^2)',	 'y74',	't74');
Angle74=asin(Result.t74)*(180/pi);

%第75次旋转对应方程组:
Result=solve('2.138638e+001=(45+9.30634)*sqrt(1-t75^2)+(0+5.55604)*t75',	 'y75=(-9.30634-45)*t75+(0+5.55604)*sqrt(1-t75^2)',	 'y75',	't75');
Angle75=asin(Result.t75)*(180/pi);

%第76次旋转对应方程组:
Result=solve('2.221972e+001=(45+9.30634)*sqrt(1-t76^2)+(0+5.55604)*t76',	 'y76=(-9.30634-45)*t76+(0+5.55604)*sqrt(1-t76^2)',	 'y76',	't76');
Angle76=asin(Result.t76)*(180/pi);

%第77次旋转对应方程组:
Result=solve('2.305306e+001=(45+9.30634)*sqrt(1-t77^2)+(0+5.55604)*t77',	 'y77=(-9.30634-45)*t77+(0+5.55604)*sqrt(1-t77^2)',	 'y77',	't77');
Angle77=asin(Result.t77)*(180/pi);

%第78次旋转对应方程组:
Result=solve('2.388640e+001=(45+9.30634)*sqrt(1-t78^2)+(0+5.55604)*t78',	 'y78=(-9.30634-45)*t78+(0+5.55604)*sqrt(1-t78^2)',	 'y78',	't78');
Angle78=asin(Result.t78)*(180/pi);

%第79次旋转对应方程组:
Result=solve('2.471974e+001=(45+9.30634)*sqrt(1-t79^2)+(0+5.55604)*t79',	 'y79=(-9.30634-45)*t79+(0+5.55604)*sqrt(1-t79^2)',	 'y79',	't79');
Angle79=asin(Result.t79)*(180/pi);

%第80次旋转对应方程组:
Result=solve('2.555308e+001=(45+9.30634)*sqrt(1-t80^2)+(0+5.55604)*t80',	 'y80=(-9.30634-45)*t80+(0+5.55604)*sqrt(1-t80^2)',	 'y80',	't80');
Angle80=asin(Result.t80)*(180/pi);

%第81次旋转对应方程组:
Result=solve('2.638642e+001=(45+9.30634)*sqrt(1-t81^2)+(0+5.55604)*t81',	 'y81=(-9.30634-45)*t81+(0+5.55604)*sqrt(1-t81^2)',	 'y81',	't81');
Angle81=asin(Result.t81)*(180/pi);

%第82次旋转对应方程组:
Result=solve('2.721976e+001=(45+9.30634)*sqrt(1-t82^2)+(0+5.55604)*t82',	 'y82=(-9.30634-45)*t82+(0+5.55604)*sqrt(1-t82^2)',	 'y82',	't82');
Angle82=asin(Result.t82)*(180/pi);

%第83次旋转对应方程组:
Result=solve('2.805310e+001=(45+9.30634)*sqrt(1-t83^2)+(0+5.55604)*t83',	 'y83=(-9.30634-45)*t83+(0+5.55604)*sqrt(1-t83^2)',	 'y83',	't83');
Angle83=asin(Result.t83)*(180/pi);

%第84次旋转对应方程组:
Result=solve('2.888644e+001=(45+9.30634)*sqrt(1-t84^2)+(0+5.55604)*t84',	 'y84=(-9.30634-45)*t84+(0+5.55604)*sqrt(1-t84^2)',	 'y84',	't84');
Angle84=asin(Result.t84)*(180/pi);

%第85次旋转对应方程组:
Result=solve('2.971978e+001=(45+9.30634)*sqrt(1-t85^2)+(0+5.55604)*t85',	 'y85=(-9.30634-45)*t85+(0+5.55604)*sqrt(1-t85^2)',	 'y85',	't85');
Angle85=asin(Result.t85)*(180/pi);

%第86次旋转对应方程组:
Result=solve('3.055312e+001=(45+9.30634)*sqrt(1-t86^2)+(0+5.55604)*t86',	 'y86=(-9.30634-45)*t86+(0+5.55604)*sqrt(1-t86^2)',	 'y86',	't86');
Angle86=asin(Result.t86)*(180/pi);

%第87次旋转对应方程组:
Result=solve('3.138646e+001=(45+9.30634)*sqrt(1-t87^2)+(0+5.55604)*t87',	 'y87=(-9.30634-45)*t87+(0+5.55604)*sqrt(1-t87^2)',	 'y87',	't87');
Angle87=asin(Result.t87)*(180/pi);

%第88次旋转对应方程组:
Result=solve('3.194202e+001=(45+9.30634)*sqrt(1-t88^2)+(0+5.55604)*t88',	 'y88=(-9.30634-45)*t88+(0+5.55604)*sqrt(1-t88^2)',	 'y88',	't88');
Angle88=asin(Result.t88)*(180/pi);

%第89次旋转对应方程组:
Result=solve('3.249758e+001=(45+9.30634)*sqrt(1-t89^2)+(0+5.55604)*t89',	 'y89=(-9.30634-45)*t89+(0+5.55604)*sqrt(1-t89^2)',	 'y89',	't89');
Angle89=asin(Result.t89)*(180/pi);

%第90次旋转对应方程组:
Result=solve('3.333092e+001=(45+9.30634)*sqrt(1-t90^2)+(0+5.55604)*t90',	 'y90=(-9.30634-45)*t90+(0+5.55604)*sqrt(1-t90^2)',	 'y90',	't90');
Angle90=asin(Result.t90)*(180/pi);

%第91次旋转对应方程组:
Result=solve('3.388648e+001=(45+9.30634)*sqrt(1-t91^2)+(0+5.55604)*t91',	 'y91=(-9.30634-45)*t91+(0+5.55604)*sqrt(1-t91^2)',	 'y91',	't91');
Angle91=asin(Result.t91)*(180/pi);

%第92次旋转对应方程组:
Result=solve('3.444204e+001=(45+9.30634)*sqrt(1-t92^2)+(0+5.55604)*t92',	 'y92=(-9.30634-45)*t92+(0+5.55604)*sqrt(1-t92^2)',	 'y92',	't92');
Angle92=asin(Result.t92)*(180/pi);

%第93次旋转对应方程组:
Result=solve('3.499760e+001=(45+9.30634)*sqrt(1-t93^2)+(0+5.55604)*t93',	 'y93=(-9.30634-45)*t93+(0+5.55604)*sqrt(1-t93^2)',	 'y93',	't93');
Angle93=asin(Result.t93)*(180/pi);

%第94次旋转对应方程组:
Result=solve('3.527538e+001=(45+9.30634)*sqrt(1-t94^2)+(0+5.55604)*t94',	 'y94=(-9.30634-45)*t94+(0+5.55604)*sqrt(1-t94^2)',	 'y94',	't94');
Angle94=asin(Result.t94)*(180/pi);

%第95次旋转对应方程组:
Result=solve('3.583094e+001=(45+9.30634)*sqrt(1-t95^2)+(0+5.55604)*t95',	 'y95=(-9.30634-45)*t95+(0+5.55604)*sqrt(1-t95^2)',	 'y95',	't95');
Angle95=asin(Result.t95)*(180/pi);

%第96次旋转对应方程组:
Result=solve('3.638650e+001=(45+9.30634)*sqrt(1-t96^2)+(0+5.55604)*t96',	 'y96=(-9.30634-45)*t96+(0+5.55604)*sqrt(1-t96^2)',	 'y96',	't96');
Angle96=asin(Result.t96)*(180/pi);

%第97次旋转对应方程组:
Result=solve('3.694206e+001=(45+9.30634)*sqrt(1-t97^2)+(0+5.55604)*t97',	 'y97=(-9.30634-45)*t97+(0+5.55604)*sqrt(1-t97^2)',	 'y97',	't97');
Angle97=asin(Result.t97)*(180/pi);

%第98次旋转对应方程组:
Result=solve('3.777540e+001=(45+9.30634)*sqrt(1-t98^2)+(0+5.55604)*t98',	 'y98=(-9.30634-45)*t98+(0+5.55604)*sqrt(1-t98^2)',	 'y98',	't98');
Angle98=asin(Result.t98)*(180/pi);

%第99次旋转对应方程组:
Result=solve('3.833096e+001=(45+9.30634)*sqrt(1-t99^2)+(0+5.55604)*t99',	 'y99=(-9.30634-45)*t99+(0+5.55604)*sqrt(1-t99^2)',	 'y99',	't99');
Angle99=asin(Result.t99)*(180/pi);

%第100次旋转对应方程组:
Result=solve('3.916430e+001=(45+9.30634)*sqrt(1-t100^2)+(0+5.55604)*t100',	 'y100=(-9.30634-45)*t100+(0+5.55604)*sqrt(1-t100^2)',	 'y100',	't100');
Angle100=asin(Result.t100)*(180/pi);

%第101次旋转对应方程组:
Result=solve('3.971986e+001=(45+9.30634)*sqrt(1-t101^2)+(0+5.55604)*t101',	 'y101=(-9.30634-45)*t101+(0+5.55604)*sqrt(1-t101^2)',	 'y101',	't101');
Angle101=asin(Result.t101)*(180/pi);

%第102次旋转对应方程组:
Result=solve('4.027542e+001=(45+9.30634)*sqrt(1-t102^2)+(0+5.55604)*t102',	 'y102=(-9.30634-45)*t102+(0+5.55604)*sqrt(1-t102^2)',	 'y102',	't102');
Angle102=asin(Result.t102)*(180/pi);

%第103次旋转对应方程组:
Result=solve('4.055320e+001=(45+9.30634)*sqrt(1-t103^2)+(0+5.55604)*t103',	 'y103=(-9.30634-45)*t103+(0+5.55604)*sqrt(1-t103^2)',	 'y103',	't103');
Angle103=asin(Result.t103)*(180/pi);

%第104次旋转对应方程组:
Result=solve('4.110876e+001=(45+9.30634)*sqrt(1-t104^2)+(0+5.55604)*t104',	 'y104=(-9.30634-45)*t104+(0+5.55604)*sqrt(1-t104^2)',	 'y104',	't104');
Angle104=asin(Result.t104)*(180/pi);

%第105次旋转对应方程组:
Result=solve('4.166432e+001=(45+9.30634)*sqrt(1-t105^2)+(0+5.55604)*t105',	 'y105=(-9.30634-45)*t105+(0+5.55604)*sqrt(1-t105^2)',	 'y105',	't105');
Angle105=asin(Result.t105)*(180/pi);

%第106次旋转对应方程组:
Result=solve('4.221988e+001=(45+9.30634)*sqrt(1-t106^2)+(0+5.55604)*t106',	 'y106=(-9.30634-45)*t106+(0+5.55604)*sqrt(1-t106^2)',	 'y106',	't106');
Angle106=asin(Result.t106)*(180/pi);

%第107次旋转对应方程组:
Result=solve('4.305322e+001=(45+9.30634)*sqrt(1-t107^2)+(0+5.55604)*t107',	 'y107=(-9.30634-45)*t107+(0+5.55604)*sqrt(1-t107^2)',	 'y107',	't107');
Angle107=asin(Result.t107)*(180/pi);

%第108次旋转对应方程组:
Result=solve('4.360878e+001=(45+9.30634)*sqrt(1-t108^2)+(0+5.55604)*t108',	 'y108=(-9.30634-45)*t108+(0+5.55604)*sqrt(1-t108^2)',	 'y108',	't108');
Angle108=asin(Result.t108)*(180/pi);

%第109次旋转对应方程组:
Result=solve('4.416434e+001=(45+9.30634)*sqrt(1-t109^2)+(0+5.55604)*t109',	 'y109=(-9.30634-45)*t109+(0+5.55604)*sqrt(1-t109^2)',	 'y109',	't109');
Angle109=asin(Result.t109)*(180/pi);

%第110次旋转对应方程组:
Result=solve('4.471990e+001=(45+9.30634)*sqrt(1-t110^2)+(0+5.55604)*t110',	 'y110=(-9.30634-45)*t110+(0+5.55604)*sqrt(1-t110^2)',	 'y110',	't110');
Angle110=asin(Result.t110)*(180/pi);

%第111次旋转对应方程组:
Result=solve('4.527546e+001=(45+9.30634)*sqrt(1-t111^2)+(0+5.55604)*t111',	 'y111=(-9.30634-45)*t111+(0+5.55604)*sqrt(1-t111^2)',	 'y111',	't111');
Angle111=asin(Result.t111)*(180/pi);

%第112次旋转对应方程组:
Result=solve('4.555324e+001=(45+9.30634)*sqrt(1-t112^2)+(0+5.55604)*t112',	 'y112=(-9.30634-45)*t112+(0+5.55604)*sqrt(1-t112^2)',	 'y112',	't112');
Angle112=asin(Result.t112)*(180/pi);

%第113次旋转对应方程组:
Result=solve('4.610880e+001=(45+9.30634)*sqrt(1-t113^2)+(0+5.55604)*t113',	 'y113=(-9.30634-45)*t113+(0+5.55604)*sqrt(1-t113^2)',	 'y113',	't113');
Angle113=asin(Result.t113)*(180/pi);

%第114次旋转对应方程组:
Result=solve('4.666436e+001=(45+9.30634)*sqrt(1-t114^2)+(0+5.55604)*t114',	 'y114=(-9.30634-45)*t114+(0+5.55604)*sqrt(1-t114^2)',	 'y114',	't114');
Angle114=asin(Result.t114)*(180/pi);

%第115次旋转对应方程组:
Result=solve('4.721992e+001=(45+9.30634)*sqrt(1-t115^2)+(0+5.55604)*t115',	 'y115=(-9.30634-45)*t115+(0+5.55604)*sqrt(1-t115^2)',	 'y115',	't115');
Angle115=asin(Result.t115)*(180/pi);

%第116次旋转对应方程组:
Result=solve('4.777548e+001=(45+9.30634)*sqrt(1-t116^2)+(0+5.55604)*t116',	 'y116=(-9.30634-45)*t116+(0+5.55604)*sqrt(1-t116^2)',	 'y116',	't116');
Angle116=asin(Result.t116)*(180/pi);

%第117次旋转对应方程组:
Result=solve('4.805326e+001=(45+9.30634)*sqrt(1-t117^2)+(0+5.55604)*t117',	 'y117=(-9.30634-45)*t117+(0+5.55604)*sqrt(1-t117^2)',	 'y117',	't117');
Angle117=asin(Result.t117)*(180/pi);

%第118次旋转对应方程组:
Result=solve('4.860882e+001=(45+9.30634)*sqrt(1-t118^2)+(0+5.55604)*t118',	 'y118=(-9.30634-45)*t118+(0+5.55604)*sqrt(1-t118^2)',	 'y118',	't118');
Angle118=asin(Result.t118)*(180/pi);

%第119次旋转对应方程组:
Result=solve('4.888660e+001=(45+9.30634)*sqrt(1-t119^2)+(0+5.55604)*t119',	 'y119=(-9.30634-45)*t119+(0+5.55604)*sqrt(1-t119^2)',	 'y119',	't119');
Angle119=asin(Result.t119)*(180/pi);

%第120次旋转对应方程组:
Result=solve('4.944216e+001=(45+9.30634)*sqrt(1-t120^2)+(0+5.55604)*t120',	 'y120=(-9.30634-45)*t120+(0+5.55604)*sqrt(1-t120^2)',	 'y120',	't120');
Angle120=asin(Result.t120)*(180/pi);

%第121次旋转对应方程组:
Result=solve('4.971994e+001=(45+9.30634)*sqrt(1-t121^2)+(0+5.55604)*t121',	 'y121=(-9.30634-45)*t121+(0+5.55604)*sqrt(1-t121^2)',	 'y121',	't121');
Angle121=asin(Result.t121)*(180/pi);

%第122次旋转对应方程组:
Result=solve('5.027550e+001=(45+9.30634)*sqrt(1-t122^2)+(0+5.55604)*t122',	 'y122=(-9.30634-45)*t122+(0+5.55604)*sqrt(1-t122^2)',	 'y122',	't122');
Angle122=asin(Result.t122)*(180/pi);

%第123次旋转对应方程组:
Result=solve('5.055328e+001=(45+9.30634)*sqrt(1-t123^2)+(0+5.55604)*t123',	 'y123=(-9.30634-45)*t123+(0+5.55604)*sqrt(1-t123^2)',	 'y123',	't123');
Angle123=asin(Result.t123)*(180/pi);

%第124次旋转对应方程组:
Result=solve('5.083106e+001=(45+9.30634)*sqrt(1-t124^2)+(0+5.55604)*t124',	 'y124=(-9.30634-45)*t124+(0+5.55604)*sqrt(1-t124^2)',	 'y124',	't124');
Angle124=asin(Result.t124)*(180/pi);

%第125次旋转对应方程组:
Result=solve('5.110884e+001=(45+9.30634)*sqrt(1-t125^2)+(0+5.55604)*t125',	 'y125=(-9.30634-45)*t125+(0+5.55604)*sqrt(1-t125^2)',	 'y125',	't125');
Angle125=asin(Result.t125)*(180/pi);

%第126次旋转对应方程组:
Result=solve('5.138662e+001=(45+9.30634)*sqrt(1-t126^2)+(0+5.55604)*t126',	 'y126=(-9.30634-45)*t126+(0+5.55604)*sqrt(1-t126^2)',	 'y126',	't126');
Angle126=asin(Result.t126)*(180/pi);

%第127次旋转对应方程组:
Result=solve('5.166440e+001=(45+9.30634)*sqrt(1-t127^2)+(0+5.55604)*t127',	 'y127=(-9.30634-45)*t127+(0+5.55604)*sqrt(1-t127^2)',	 'y127',	't127');
Angle127=asin(Result.t127)*(180/pi);

%第128次旋转对应方程组:
Result=solve('5.221996e+001=(45+9.30634)*sqrt(1-t128^2)+(0+5.55604)*t128',	 'y128=(-9.30634-45)*t128+(0+5.55604)*sqrt(1-t128^2)',	 'y128',	't128');
Angle128=asin(Result.t128)*(180/pi);

%第129次旋转对应方程组:
Result=solve('5.221996e+001=(45+9.30634)*sqrt(1-t129^2)+(0+5.55604)*t129',	 'y129=(-9.30634-45)*t129+(0+5.55604)*sqrt(1-t129^2)',	 'y129',	't129');
Angle129=asin(Result.t129)*(180/pi);

%第130次旋转对应方程组:
Result=solve('5.249774e+001=(45+9.30634)*sqrt(1-t130^2)+(0+5.55604)*t130',	 'y130=(-9.30634-45)*t130+(0+5.55604)*sqrt(1-t130^2)',	 'y130',	't130');
Angle130=asin(Result.t130)*(180/pi);

%第131次旋转对应方程组:
Result=solve('5.277552e+001=(45+9.30634)*sqrt(1-t131^2)+(0+5.55604)*t131',	 'y131=(-9.30634-45)*t131+(0+5.55604)*sqrt(1-t131^2)',	 'y131',	't131');
Angle131=asin(Result.t131)*(180/pi);

%第132次旋转对应方程组:
Result=solve('5.305330e+001=(45+9.30634)*sqrt(1-t132^2)+(0+5.55604)*t132',	 'y132=(-9.30634-45)*t132+(0+5.55604)*sqrt(1-t132^2)',	 'y132',	't132');
Angle132=asin(Result.t132)*(180/pi);

%第133次旋转对应方程组:
Result=solve('5.333108e+001=(45+9.30634)*sqrt(1-t133^2)+(0+5.55604)*t133',	 'y133=(-9.30634-45)*t133+(0+5.55604)*sqrt(1-t133^2)',	 'y133',	't133');
Angle133=asin(Result.t133)*(180/pi);

%第134次旋转对应方程组:
Result=solve('5.333108e+001=(45+9.30634)*sqrt(1-t134^2)+(0+5.55604)*t134',	 'y134=(-9.30634-45)*t134+(0+5.55604)*sqrt(1-t134^2)',	 'y134',	't134');
Angle134=asin(Result.t134)*(180/pi);

%第135次旋转对应方程组:
Result=solve('5.360886e+001=(45+9.30634)*sqrt(1-t135^2)+(0+5.55604)*t135',	 'y135=(-9.30634-45)*t135+(0+5.55604)*sqrt(1-t135^2)',	 'y135',	't135');
Angle135=asin(Result.t135)*(180/pi);

%第136次旋转对应方程组:
Result=solve('5.388664e+001=(45+9.30634)*sqrt(1-t136^2)+(0+5.55604)*t136',	 'y136=(-9.30634-45)*t136+(0+5.55604)*sqrt(1-t136^2)',	 'y136',	't136');
Angle136=asin(Result.t136)*(180/pi);

%第137次旋转对应方程组:
Result=solve('5.388664e+001=(45+9.30634)*sqrt(1-t137^2)+(0+5.55604)*t137',	 'y137=(-9.30634-45)*t137+(0+5.55604)*sqrt(1-t137^2)',	 'y137',	't137');
Angle137=asin(Result.t137)*(180/pi);

%第138次旋转对应方程组:
Result=solve('5.416442e+001=(45+9.30634)*sqrt(1-t138^2)+(0+5.55604)*t138',	 'y138=(-9.30634-45)*t138+(0+5.55604)*sqrt(1-t138^2)',	 'y138',	't138');
Angle138=asin(Result.t138)*(180/pi);

%第139次旋转对应方程组:
Result=solve('5.416442e+001=(45+9.30634)*sqrt(1-t139^2)+(0+5.55604)*t139',	 'y139=(-9.30634-45)*t139+(0+5.55604)*sqrt(1-t139^2)',	 'y139',	't139');
Angle139=asin(Result.t139)*(180/pi);

%第140次旋转对应方程组:
Result=solve('5.416442e+001=(45+9.30634)*sqrt(1-t140^2)+(0+5.55604)*t140',	 'y140=(-9.30634-45)*t140+(0+5.55604)*sqrt(1-t140^2)',	 'y140',	't140');
Angle140=asin(Result.t140)*(180/pi);

%第141次旋转对应方程组:
Result=solve('5.416442e+001=(45+9.30634)*sqrt(1-t141^2)+(0+5.55604)*t141',	 'y141=(-9.30634-45)*t141+(0+5.55604)*sqrt(1-t141^2)',	 'y141',	't141');
Angle141=asin(Result.t141)*(180/pi);

%第142次旋转对应方程组:
Result=solve('5.444220e+001=(45+9.30634)*sqrt(1-t142^2)+(0+5.55604)*t142',	 'y142=(-9.30634-45)*t142+(0+5.55604)*sqrt(1-t142^2)',	 'y142',	't142');
Angle142=asin(Result.t142)*(180/pi);

%第143次旋转对应方程组:
Result=solve('5.444220e+001=(45+9.30634)*sqrt(1-t143^2)+(0+5.55604)*t143',	 'y143=(-9.30634-45)*t143+(0+5.55604)*sqrt(1-t143^2)',	 'y143',	't143');
Angle143=asin(Result.t143)*(180/pi);

%第144次旋转对应方程组:
Result=solve('5.444220e+001=(45+9.30634)*sqrt(1-t144^2)+(0+5.55604)*t144',	 'y144=(-9.30634-45)*t144+(0+5.55604)*sqrt(1-t144^2)',	 'y144',	't144');
Angle144=asin(Result.t144)*(180/pi);

%第145次旋转对应方程组:
Result=solve('5.444220e+001=(45+9.30634)*sqrt(1-t145^2)+(0+5.55604)*t145',	 'y145=(-9.30634-45)*t145+(0+5.55604)*sqrt(1-t145^2)',	 'y145',	't145');
Angle145=asin(Result.t145)*(180/pi);

%第146次旋转对应方程组:
Result=solve('5.444220e+001=(45+9.30634)*sqrt(1-t146^2)+(0+5.55604)*t146',	 'y146=(-9.30634-45)*t146+(0+5.55604)*sqrt(1-t146^2)',	 'y146',	't146');
Angle146=asin(Result.t146)*(180/pi);

%第147次旋转对应方程组:
Result=solve('5.444220e+001=(45+9.30634)*sqrt(1-t147^2)+(0+5.55604)*t147',	 'y147=(-9.30634-45)*t147+(0+5.55604)*sqrt(1-t147^2)',	 'y147',	't147');
Angle147=asin(Result.t147)*(180/pi);

%第148次旋转对应方程组:
Result=solve('5.444220e+001=(45+9.30634)*sqrt(1-t148^2)+(0+5.55604)*t148',	 'y148=(-9.30634-45)*t148+(0+5.55604)*sqrt(1-t148^2)',	 'y148',	't148');
Angle148=asin(Result.t148)*(180/pi);

%第149次旋转对应方程组:
Result=solve('5.388664e+001=(45+9.30634)*sqrt(1-t149^2)+(0+5.55604)*t149',	 'y149=(-9.30634-45)*t149+(0+5.55604)*sqrt(1-t149^2)',	 'y149',	't149');
Angle149=asin(Result.t149)*(180/pi);

%第150次旋转对应方程组:
Result=solve('5.416442e+001=(45+9.30634)*sqrt(1-t150^2)+(0+5.55604)*t150',	 'y150=(-9.30634-45)*t150+(0+5.55604)*sqrt(1-t150^2)',	 'y150',	't150');
Angle150=asin(Result.t150)*(180/pi);

%第151次旋转对应方程组:
Result=solve('5.416442e+001=(45+9.30634)*sqrt(1-t151^2)+(0+5.55604)*t151',	 'y151=(-9.30634-45)*t151+(0+5.55604)*sqrt(1-t151^2)',	 'y151',	't151');
Angle151=asin(Result.t151)*(180/pi);

%第152次旋转对应方程组:
Result=solve('5.388664e+001=(45+9.30634)*sqrt(1-t152^2)+(0+5.55604)*t152',	 'y152=(-9.30634-45)*t152+(0+5.55604)*sqrt(1-t152^2)',	 'y152',	't152');
Angle152=asin(Result.t152)*(180/pi);

%第153次旋转对应方程组:
Result=solve('5.388664e+001=(45+9.30634)*sqrt(1-t153^2)+(0+5.55604)*t153',	 'y153=(-9.30634-45)*t153+(0+5.55604)*sqrt(1-t153^2)',	 'y153',	't153');
Angle153=asin(Result.t153)*(180/pi);

%第154次旋转对应方程组:
Result=solve('5.360886e+001=(45+9.30634)*sqrt(1-t154^2)+(0+5.55604)*t154',	 'y154=(-9.30634-45)*t154+(0+5.55604)*sqrt(1-t154^2)',	 'y154',	't154');
Angle154=asin(Result.t154)*(180/pi);

%第155次旋转对应方程组:
Result=solve('5.360886e+001=(45+9.30634)*sqrt(1-t155^2)+(0+5.55604)*t155',	 'y155=(-9.30634-45)*t155+(0+5.55604)*sqrt(1-t155^2)',	 'y155',	't155');
Angle155=asin(Result.t155)*(180/pi);

%第156次旋转对应方程组:
Result=solve('5.333108e+001=(45+9.30634)*sqrt(1-t156^2)+(0+5.55604)*t156',	 'y156=(-9.30634-45)*t156+(0+5.55604)*sqrt(1-t156^2)',	 'y156',	't156');
Angle156=asin(Result.t156)*(180/pi);

%第157次旋转对应方程组:
Result=solve('5.305330e+001=(45+9.30634)*sqrt(1-t157^2)+(0+5.55604)*t157',	 'y157=(-9.30634-45)*t157+(0+5.55604)*sqrt(1-t157^2)',	 'y157',	't157');
Angle157=asin(Result.t157)*(180/pi);

%第158次旋转对应方程组:
Result=solve('5.305330e+001=(45+9.30634)*sqrt(1-t158^2)+(0+5.55604)*t158',	 'y158=(-9.30634-45)*t158+(0+5.55604)*sqrt(1-t158^2)',	 'y158',	't158');
Angle158=asin(Result.t158)*(180/pi);

%第159次旋转对应方程组:
Result=solve('5.277552e+001=(45+9.30634)*sqrt(1-t159^2)+(0+5.55604)*t159',	 'y159=(-9.30634-45)*t159+(0+5.55604)*sqrt(1-t159^2)',	 'y159',	't159');
Angle159=asin(Result.t159)*(180/pi);

%第160次旋转对应方程组:
Result=solve('5.249774e+001=(45+9.30634)*sqrt(1-t160^2)+(0+5.55604)*t160',	 'y160=(-9.30634-45)*t160+(0+5.55604)*sqrt(1-t160^2)',	 'y160',	't160');
Angle160=asin(Result.t160)*(180/pi);

%第161次旋转对应方程组:
Result=solve('5.221996e+001=(45+9.30634)*sqrt(1-t161^2)+(0+5.55604)*t161',	 'y161=(-9.30634-45)*t161+(0+5.55604)*sqrt(1-t161^2)',	 'y161',	't161');
Angle161=asin(Result.t161)*(180/pi);

%第162次旋转对应方程组:
Result=solve('5.194218e+001=(45+9.30634)*sqrt(1-t162^2)+(0+5.55604)*t162',	 'y162=(-9.30634-45)*t162+(0+5.55604)*sqrt(1-t162^2)',	 'y162',	't162');
Angle162=asin(Result.t162)*(180/pi);

%第163次旋转对应方程组:
Result=solve('5.166440e+001=(45+9.30634)*sqrt(1-t163^2)+(0+5.55604)*t163',	 'y163=(-9.30634-45)*t163+(0+5.55604)*sqrt(1-t163^2)',	 'y163',	't163');
Angle163=asin(Result.t163)*(180/pi);

%第164次旋转对应方程组:
Result=solve('5.138662e+001=(45+9.30634)*sqrt(1-t164^2)+(0+5.55604)*t164',	 'y164=(-9.30634-45)*t164+(0+5.55604)*sqrt(1-t164^2)',	 'y164',	't164');
Angle164=asin(Result.t164)*(180/pi);

%第165次旋转对应方程组:
Result=solve('5.110884e+001=(45+9.30634)*sqrt(1-t165^2)+(0+5.55604)*t165',	 'y165=(-9.30634-45)*t165+(0+5.55604)*sqrt(1-t165^2)',	 'y165',	't165');
Angle165=asin(Result.t165)*(180/pi);

%第166次旋转对应方程组:
Result=solve('5.055328e+001=(45+9.30634)*sqrt(1-t166^2)+(0+5.55604)*t166',	 'y166=(-9.30634-45)*t166+(0+5.55604)*sqrt(1-t166^2)',	 'y166',	't166');
Angle166=asin(Result.t166)*(180/pi);

%第167次旋转对应方程组:
Result=solve('5.027550e+001=(45+9.30634)*sqrt(1-t167^2)+(0+5.55604)*t167',	 'y167=(-9.30634-45)*t167+(0+5.55604)*sqrt(1-t167^2)',	 'y167',	't167');
Angle167=asin(Result.t167)*(180/pi);

%第168次旋转对应方程组:
Result=solve('4.999772e+001=(45+9.30634)*sqrt(1-t168^2)+(0+5.55604)*t168',	 'y168=(-9.30634-45)*t168+(0+5.55604)*sqrt(1-t168^2)',	 'y168',	't168');
Angle168=asin(Result.t168)*(180/pi);

%第169次旋转对应方程组:
Result=solve('4.944216e+001=(45+9.30634)*sqrt(1-t169^2)+(0+5.55604)*t169',	 'y169=(-9.30634-45)*t169+(0+5.55604)*sqrt(1-t169^2)',	 'y169',	't169');
Angle169=asin(Result.t169)*(180/pi);

%第170次旋转对应方程组:
Result=solve('4.916438e+001=(45+9.30634)*sqrt(1-t170^2)+(0+5.55604)*t170',	 'y170=(-9.30634-45)*t170+(0+5.55604)*sqrt(1-t170^2)',	 'y170',	't170');
Angle170=asin(Result.t170)*(180/pi);

%第171次旋转对应方程组:
Result=solve('4.888660e+001=(45+9.30634)*sqrt(1-t171^2)+(0+5.55604)*t171',	 'y171=(-9.30634-45)*t171+(0+5.55604)*sqrt(1-t171^2)',	 'y171',	't171');
Angle171=asin(Result.t171)*(180/pi);

%第172次旋转对应方程组:
Result=solve('4.833104e+001=(45+9.30634)*sqrt(1-t172^2)+(0+5.55604)*t172',	 'y172=(-9.30634-45)*t172+(0+5.55604)*sqrt(1-t172^2)',	 'y172',	't172');
Angle172=asin(Result.t172)*(180/pi);

%第173次旋转对应方程组:
Result=solve('4.777548e+001=(45+9.30634)*sqrt(1-t173^2)+(0+5.55604)*t173',	 'y173=(-9.30634-45)*t173+(0+5.55604)*sqrt(1-t173^2)',	 'y173',	't173');
Angle173=asin(Result.t173)*(180/pi);

%第174次旋转对应方程组:
Result=solve('4.749770e+001=(45+9.30634)*sqrt(1-t174^2)+(0+5.55604)*t174',	 'y174=(-9.30634-45)*t174+(0+5.55604)*sqrt(1-t174^2)',	 'y174',	't174');
Angle174=asin(Result.t174)*(180/pi);

%第175次旋转对应方程组:
Result=solve('4.694214e+001=(45+9.30634)*sqrt(1-t175^2)+(0+5.55604)*t175',	 'y175=(-9.30634-45)*t175+(0+5.55604)*sqrt(1-t175^2)',	 'y175',	't175');
Angle175=asin(Result.t175)*(180/pi);

%第176次旋转对应方程组:
Result=solve('4.638658e+001=(45+9.30634)*sqrt(1-t176^2)+(0+5.55604)*t176',	 'y176=(-9.30634-45)*t176+(0+5.55604)*sqrt(1-t176^2)',	 'y176',	't176');
Angle176=asin(Result.t176)*(180/pi);

%第177次旋转对应方程组:
Result=solve('4.583102e+001=(45+9.30634)*sqrt(1-t177^2)+(0+5.55604)*t177',	 'y177=(-9.30634-45)*t177+(0+5.55604)*sqrt(1-t177^2)',	 'y177',	't177');
Angle177=asin(Result.t177)*(180/pi);

%第178次旋转对应方程组:
Result=solve('4.555324e+001=(45+9.30634)*sqrt(1-t178^2)+(0+5.55604)*t178',	 'y178=(-9.30634-45)*t178+(0+5.55604)*sqrt(1-t178^2)',	 'y178',	't178');
Angle178=asin(Result.t178)*(180/pi);

%第179次旋转对应方程组:
Result=solve('4.499768e+001=(45+9.30634)*sqrt(1-t179^2)+(0+5.55604)*t179',	 'y179=(-9.30634-45)*t179+(0+5.55604)*sqrt(1-t179^2)',	 'y179',	't179');
Angle179=asin(Result.t179)*(180/pi);

%第180次旋转对应方程组:
Result=solve('4.444212e+001=(45+9.30634)*sqrt(1-t180^2)+(0+5.55604)*t180',	 'y180=(-9.30634-45)*t180+(0+5.55604)*sqrt(1-t180^2)',	 'y180',	't180');
Angle180=asin(Result.t180)*(180/pi);


%数据输出
Angle1
Angle2
Angle3
Angle4
Angle5
Angle6
Angle7
Angle8
Angle9
Angle10
Angle11
Angle12
Angle13
Angle14
Angle15
Angle16
Angle17
Angle18
Angle19
Angle20
Angle21
Angle22
Angle23
Angle24
Angle25
Angle26
Angle27
Angle28
Angle29
Angle30
Angle31
Angle32
Angle33
Angle34
Angle35
Angle36
Angle37
Angle38
Angle39
Angle40
Angle41
Angle42
Angle43
Angle44
Angle45
Angle46
Angle47
Angle48
Angle49
Angle50
Angle51
Angle52
Angle53
Angle54
Angle55
Angle56
Angle57
Angle58
Angle59
Angle60
Angle61
Angle62
Angle63
Angle64
Angle65
Angle66
Angle67
Angle68
Angle69
Angle70
Angle71
Angle72
Angle73
Angle74
Angle75
Angle76
Angle77
Angle78
Angle79
Angle80
Angle81
Angle82
Angle83
Angle84
Angle85
Angle86
Angle87
Angle88
Angle89
Angle90
Angle91
Angle92
Angle93
Angle94
Angle95
Angle96
Angle97
Angle98
Angle99
Angle100
Angle101
Angle102
Angle103
Angle104
Angle105
Angle106
Angle107
Angle108
Angle109
Angle110
Angle111
Angle112
Angle113
Angle114
Angle115
Angle116
Angle117
Angle118
Angle119
Angle120
Angle121
Angle122
Angle123
Angle124
Angle125
Angle126
Angle127
Angle128
Angle129
Angle130
Angle131
Angle132
Angle133
Angle134
Angle135
Angle136
Angle137
Angle138
Angle139
Angle140
Angle141
Angle142
Angle143
Angle144
Angle145
Angle146
Angle147
Angle148
Angle149
Angle150
Angle151
Angle152
Angle153
Angle154
Angle155
Angle156
Angle157
Angle158
Angle159
Angle160
Angle161
Angle162
Angle163
Angle164
Angle165
Angle166
Angle167
Angle168
Angle169
Angle170
Angle171
Angle172
Angle173
Angle174
Angle175
Angle176
Angle177
Angle178
Angle179
Angle180

